# TextureRealWorldOffsetZ Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wood..::..TextureRealWorldOffsetZ Property
Wood Class See Also
---
The property labeled "Offset Z" from the "Wood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string TextureRealWorldOffsetZ { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextureRealWorldOffsetZ As String
	Get
```

Visual C++
---
```text
public:
static property String^ TextureRealWorldOffsetZ {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDistance".
# See Also
Wood Class
Autodesk.Revit.DB.Visual Namespace